SunCity/src/Documents/УстановкаПлощадиВыкладки/УстановкаПлощадиВыкладки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаПлощадиВыкладки</name>
  <registerRecords>InformationRegister.ПлощадьТорговогоПространства</registerRecords>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановкиПлощадиВыкладки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяПлощадьВыкладки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПлощадиВыкладки</name>
    <attributes>
      <name>ТоварнаяГруппа</name>
      <type>
        <types>CatalogRef.ТоварныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлощадьВыкладки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/Documents/УстановкаПлощадиВыкладки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктОРасхожденияхПриПриемкеТоваров - документ для инициализации данных.
//  ДополнительныеСвойства - Структура - структура дополнительных свойств.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос(
	// 0 ТаблицаПлощадьТорговогоПространства
	"ВЫБРАТЬ
	|	УстановкаПлощадиВыкладкиПлощадиВыкладки.НомерСтроки КАК НСтр,
	|	УстановкаПлощадиВыкладкиПлощадиВыкладки.ТоварнаяГруппа,
	|	УстановкаПлощадиВыкладкиПлощадиВыкладки.ПлощадьВыкладки,
	|	УстановкаПлощадиВыкладки.Магазин,
	|	УстановкаПлощадиВыкладки.ДатаУстановкиПлощадиВыкладки КАК Период
	|ИЗ
	|	Документ.УстановкаПлощадиВыкладки.ПлощадиВыкладки КАК УстановкаПлощадиВыкладкиПлощадиВыкладки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаПлощадиВыкладки КАК УстановкаПлощадиВыкладки
	|		ПО УстановкаПлощадиВыкладкиПлощадиВыкладки.Ссылка = УстановкаПлощадиВыкладки.Ссылка
	|ГДЕ
	|	УстановкаПлощадиВыкладки.Ссылка = &Ссылка
	|	И УстановкаПлощадиВыкладкиПлощадиВыкладки.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НСтр");

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.ВыполнитьПакет();

	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлощадьТорговогоПространства", Результат[0].Выгрузить());
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Магазин)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецЕсли
